ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0gx218_gx207/DMA_1.0.xml
        </group>
    <group id="DMA_GEN_EVENT" name="DMA_GEN_EVENT" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="DMA_GEN_EVENT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status." begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="DMACH0" value="0x1" description="DMA Channel 0 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH1" value="0x2" description="DMA Channel 1 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH2" value="0x3" description="DMA Channel 2 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH3" value="0x4" description="DMA Channel 3 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH4" value="0x5" description="DMA Channel 4 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH5" value="0x6" description="DMA Channel 5 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH6" value="0x7" description="DMA Channel 6 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH7" value="0x8" description="DMA Channel 7 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH8" value="0x9" description="DMA Channel 8 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH9" value="0xA" description="DMA Channel 9 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH10" value="0xB" description="DMA Channel 10 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH11" value="0xC" description="DMA Channel 11 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH12" value="0xD" description="DMA Channel 12 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH13" value="0xE" description="DMA Channel 13 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH14" value="0xF" description="DMA Channel 14 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH15" value="0x10" description="DMA Channel 15 size counter reached zero (DMASZ=0)."/>
                <bitenum id="PREIRQCH0" value="0x11" description="PRE-IRQ event for DMA Channel 0."/>
                <bitenum id="PREIRQCH1" value="0x12" description="PRE-IRQ event for DMA Channel 1."/>
                <bitenum id="PREIRQCH2" value="0x13" description="PRE-IRQ event for DMA Channel 2."/>
                <bitenum id="PREIRQCH3" value="0x14" description="PRE-IRQ event for DMA Channel 3."/>
                <bitenum id="PREIRQCH4" value="0x15" description="PRE-IRQ event for DMA Channel 4."/>
                <bitenum id="PREIRQCH5" value="0x16" description="PRE-IRQ event for DMA Channel 5."/>
                <bitenum id="PREIRQCH6" value="0x17" description="PRE-IRQ event for DMA Channel 6."/>
                <bitenum id="PREIRQCH7" value="0x18" description="PRE-IRQ event for DMA Channel 7."/>
                <bitenum id="ADDRERR" value="0x19" description="DMA address error, SRC address not reachable."/>
                <bitenum id="DATAERR" value="0x1A" description="DMA data error, SRC data might be corrupted (PAR or ECC error)."/>
            </bitfield>
        </register>
        <register id="DMA_GEN_EVENT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signal. Size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signal. Size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signal. Size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH3" description="DMA Channel 3 interrupt signal. Size counter reached zero (DMASZ=0)." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH4" description="DMA Channel 4 interrupt signal. Size counter reached zero (DMASZ=0)." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH5" description="DMA Channel 5 interrupt signal. Size counter reached zero (DMASZ=0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH6" description="DMA Channel 6 interrupt signal. Size counter reached zero (DMASZ=0)." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH7" description="DMA Channel 7 interrupt signal. Size counter reached zero (DMASZ=0)." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DMACH8" description="DMA Channel 8 interrupt signal. Size counter reached zero (DMASZ=0)." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH1" description="Pre-IRQ for Channel 1. Size counter reached Pre-IRQ threshold." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH2" description="Pre-IRQ for Channel 2. Size counter reached Pre-IRQ threshold." begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH3" description="Pre-IRQ for Channel 3. Size counter reached Pre-IRQ threshold." begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH4" description="Pre-IRQ for Channel 4. Size counter reached Pre-IRQ threshold." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
        <register id="DMA_GEN_EVENT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signals that size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signals that size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signals that size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH3" description="DMA Channel 3 interrupt signals that size counter reached zero (DMASZ=0)." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH4" description="DMA Channel 4 interrupt signals that size counter reached zero (DMASZ=0)." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH5" description="DMA Channel 5 interrupt signals that size counter reached zero (DMASZ=0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH6" description="DMA Channel 6 interrupt signals that size counter reached zero (DMASZ=0)." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH7" description="DMA Channel 7 interrupt signals that size counter reached zero (DMASZ=0)." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH8" description="DMA Channel 8 interrupt signals that size counter reached zero (DMASZ=0)." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH1" description="Pre-IRQ for Channel 1. Size counter reached Pre-IRQ threshold." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH2" description="Pre-IRQ for Channel 2. Size counter reached Pre-IRQ threshold." begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH3" description="Pre-IRQ for Channel 3. Size counter reached Pre-IRQ threshold." begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH4" description="Pre-IRQ for Channel 4. Size counter reached Pre-IRQ threshold." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
        <register id="DMA_GEN_EVENT_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signals that size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signals that size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signals that size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH3" description="DMA Channel 3 interrupt signals that size counter reached zero (DMASZ=0)." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH4" description="DMA Channel 4 interrupt signals that size counter reached zero (DMASZ=0)." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH5" description="DMA Channel 5 interrupt signals that size counter reached zero (DMASZ=0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH6" description="DMA Channel 6 interrupt signals that size counter reached zero (DMASZ=0)." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH7" description="DMA Channel 7 interrupt signals that size counter reached zero (DMASZ=0)." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMACH8" description="DMA Channel 8 interrupt signals that size counter reached zero (DMASZ=0)." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur or is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH1" description="Pre-IRQ for Channel 1. Size counter reached Pre-IRQ threshold." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH2" description="Pre-IRQ for Channel 2. Size counter reached Pre-IRQ threshold." begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH3" description="Pre-IRQ for Channel 3. Size counter reached Pre-IRQ threshold." begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH4" description="Pre-IRQ for Channel 4. Size counter reached Pre-IRQ threshold." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
